//Задача 10: Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
Console.Clear();
Console.Write("Введите 3-х значное число: ");
string a = Console.ReadLine();
Console.WriteLine(a[1]);